// Задача №5. Напишите программу, которая на вход принимает одно число (N),
// а на выходе показывает все целые числа в промежутке от -N до N.
// Например:
// 4-> "-4, -3, -2, -1,0, 1,2, 3, 4"
// 2-> ” -2, -1,0, 1,2"



// _________________________________________________________
// Мое изначальное решение через while

// System.Console.Write("Введите число: ");
// int a = Convert.ToInt32(Console.ReadLine());
// int b = -a;

// while (b <= a)
// {
//     System.Console.WriteLine(b);
//     b = b + 1;
// }
// _________________________________________________________



// _________________________________________________________
// Более правильное решение через for

// Console.Write("Введите число: ");
// int N = Convert.ToInt32(Console.ReadLine());

// for (int i = -N; i <= N; i++)
// {
//     Console.Write(i);
// }
// _________________________________________________________



// _________________________________________________________
// Решение с возможностью ввода отрицательных чисел

Console.Write("Введите число: ");
int N = Math.Abs(Convert.ToInt32(Console.ReadLine()));

for (int i = -N; i <= N; i++)
{
    System.Console.Write(i + ", ");
}
// _________________________________________________________